qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_rcc_ex.h
#if defined(STM32F303xC)
#define RCC_PERIPHCLK_USART1           ((uint32_t)0x00000001)
#define RCC_PERIPHCLK_USART2           ((uint32_t)0x00000002)
#define RCC_PERIPHCLK_USART3           ((uint32_t)0x00000004)
#define RCC_PERIPHCLK_UART4            ((uint32_t)0x00000008)
#define RCC_PERIPHCLK_UART5            ((uint32_t)0x00000010)
#define RCC_PERIPHCLK_I2C1             ((uint32_t)0x00000020)
#define RCC_PERIPHCLK_I2C2             ((uint32_t)0x00000040)
#define RCC_PERIPHCLK_ADC12            ((uint32_t)0x00000080)
#define RCC_PERIPHCLK_ADC34            ((uint32_t)0x00000100)
#define RCC_PERIPHCLK_I2S              ((uint32_t)0x00000200)
#define RCC_PERIPHCLK_TIM1             ((uint32_t)0x00001000)
#define RCC_PERIPHCLK_TIM8             ((uint32_t)0x00002000)
#define RCC_PERIPHCLK_RTC              ((uint32_t)0x00010000)
#define RCC_PERIPHCLK_USB              ((uint32_t)0x00020000)

#define IS_RCC_PERIPHCLK(SELECTION) ((SELECTION) <= (RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART2 | RCC_PERIPHCLK_USART3 | \
                                                     RCC_PERIPHCLK_UART4  | RCC_PERIPHCLK_UART5  | \
                                                     RCC_PERIPHCLK_I2C1   | RCC_PERIPHCLK_I2C2   | \
                                                     RCC_PERIPHCLK_ADC12  | RCC_PERIPHCLK_ADC34  | \
                                                     RCC_PERIPHCLK_I2S    | RCC_PERIPHCLK_TIM1   | \
                                                     RCC_PERIPHCLK_TIM8   | RCC_PERIPHCLK_RTC    | \
                                                     RCC_PERIPHCLK_USB))
#endif /* STM32F303xC */

#if defined(STM32F302xE)
#define RCC_PERIPHCLK_USART1           ((uint32_t)0x00000001)
#define RCC_PERIPHCLK_USART2           ((uint32_t)0x00000002)
#define RCC_PERIPHCLK_USART3           ((uint32_t)0x00000004)
#define RCC_PERIPHCLK_UART4            ((uint32_t)0x00000008)
#define RCC_PERIPHCLK_UART5            ((uint32_t)0x00000010)
#define RCC_PERIPHCLK_I2C1             ((uint32_t)0x00000020)
#define RCC_PERIPHCLK_I2C2             ((uint32_t)0x00000040)
#define RCC_PERIPHCLK_ADC12            ((uint32_t)0x00000080)
#define RCC_PERIPHCLK_I2S              ((uint32_t)0x00000200)
#define RCC_PERIPHCLK_TIM1             ((uint32_t)0x00001000)
#define RCC_PERIPHCLK_RTC              ((uint32_t)0x00010000)
#define RCC_PERIPHCLK_USB              ((uint32_t)0x00020000)
#define RCC_PERIPHCLK_I2C3             ((uint32_t)0x00040000)
#define RCC_PERIPHCLK_TIM2             ((uint32_t)0x00100000)
#define RCC_PERIPHCLK_TIM34            ((uint32_t)0x00200000)
#define RCC_PERIPHCLK_TIM15            ((uint32_t)0x00400000)
#define RCC_PERIPHCLK_TIM16            ((uint32_t)0x00800000)
#define RCC_PERIPHCLK_TIM17            ((uint32_t)0x01000000)

#define IS_RCC_PERIPHCLK(SELECTION) ((SELECTION) <= (RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART2 | RCC_PERIPHCLK_USART3 | \
                                                     RCC_PERIPHCLK_UART4  | RCC_PERIPHCLK_UART5  | \
                                                     RCC_PERIPHCLK_I2C1   | RCC_PERIPHCLK_I2C2   | \
                                                     RCC_PERIPHCLK_ADC12  | RCC_PERIPHCLK_I2S    | \
                                                     RCC_PERIPHCLK_TIM1   | RCC_PERIPHCLK_RTC    | \
                                                     RCC_PERIPHCLK_USB    | RCC_PERIPHCLK_I2C3   | \
                                                     RCC_PERIPHCLK_TIM2   | RCC_PERIPHCLK_TIM34  | \
                                                     RCC_PERIPHCLK_TIM15  | RCC_PERIPHCLK_TIM16  | \
                                                     RCC_PERIPHCLK_TIM17))
#endif /* STM32F302xE */

#if defined(STM32F303xE)
#define RCC_PERIPHCLK_USART1           ((uint32_t)0x00000001)
#define RCC_PERIPHCLK_USART2           ((uint32_t)0x00000002)
#define RCC_PERIPHCLK_USART3           ((uint32_t)0x00000004)
#define RCC_PERIPHCLK_UART4            ((uint32_t)0x00000008)
#define RCC_PERIPHCLK_UART5            ((uint32_t)0x00000010)
#define RCC_PERIPHCLK_I2C1             ((uint32_t)0x00000020)
#define RCC_PERIPHCLK_I2C2             ((uint32_t)0x00000040)
#define RCC_PERIPHCLK_ADC12            ((uint32_t)0x00000080)
#define RCC_PERIPHCLK_ADC34            ((uint32_t)0x00000100)
#define RCC_PERIPHCLK_I2S              ((uint32_t)0x00000200)
#define RCC_PERIPHCLK_TIM1             ((uint32_t)0x00001000)
#define RCC_PERIPHCLK_TIM8             ((uint32_t)0x00002000)
#define RCC_PERIPHCLK_RTC              ((uint32_t)0x00010000)
#define RCC_PERIPHCLK_USB              ((uint32_t)0x00020000)
#define RCC_PERIPHCLK_I2C3             ((uint32_t)0x00040000)
#define RCC_PERIPHCLK_TIM2             ((uint32_t)0x00100000)
#define RCC_PERIPHCLK_TIM34            ((uint32_t)0x00200000)
#define RCC_PERIPHCLK_TIM15            ((uint32_t)0x00400000)
#define RCC_PERIPHCLK_TIM16            ((uint32_t)0x00800000)
#define RCC_PERIPHCLK_TIM17            ((uint32_t)0x01000000)
#define RCC_PERIPHCLK_TIM20            ((uint32_t)0x02000000)

#define IS_RCC_PERIPHCLK(SELECTION) ((SELECTION) <= (RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART2 | RCC_PERIPHCLK_USART3 | \
                                                     RCC_PERIPHCLK_UART4  | RCC_PERIPHCLK_UART5  | \
                                                     RCC_PERIPHCLK_I2C1   | RCC_PERIPHCLK_I2C2   | \
                                                     RCC_PERIPHCLK_ADC12  | RCC_PERIPHCLK_ADC34  | \
                                                     RCC_PERIPHCLK_I2S    | RCC_PERIPHCLK_TIM1   | \
                                                     RCC_PERIPHCLK_TIM8   | RCC_PERIPHCLK_RTC    | \
                                                     RCC_PERIPHCLK_USB    | RCC_PERIPHCLK_I2C3   | \
                                                     RCC_PERIPHCLK_TIM2   | RCC_PERIPHCLK_TIM34  | \
                                                     RCC_PERIPHCLK_TIM15  | RCC_PERIPHCLK_TIM16  | \
                                                     RCC_PERIPHCLK_TIM17  | RCC_PERIPHCLK_TIM20))
#endif /* STM32F303xE */

